aws_docs/ApiReference_NotificationReceptorAPI_SOAPTransportArticle.html

<html xmlns:fo="http://www.w3.org/1999/XSL/Format"><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>The SOAP Transport</title><link rel="stylesheet" href="aws-docs-IE.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.74.0"><link rel="home" href="#top" title="Amazon Mechanical Turk"><link rel="up" href="ApiReference_NotificationReceptorAPIArticle.html" title="Chapter&nbsp;8.&nbsp;The Notification Receptor API"><link rel="prev" href="ApiReference_NotificationReceptorAPI_RESTTransportArticle.html" title="The REST Transport"><!--[if !IE]>--><link rel="stylesheet" href="aws-docs.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.74.0"><!--<![endif]--><meta xmlns="http://www.w3.org/1999/xhtml" http-equiv="Content-Type" content="text/html; charset=utf-8"></meta><script src="/urchin.js" type="text/javascript"></script><script type="text/javascript">
				urchinTracker();
			</script><script xmlns="http://www.w3.org/1999/xhtml" type="text/javascript" src="frameset.js"> //
		</script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header" cellspacing="0" cellpadding="2"><tr><td width="30%" align="left"><a accesskey="p" href="ApiReference_NotificationReceptorAPI_RESTTransportArticle.html"><img src="images/prev.gif" alt="Prev"></a> </td><td width="40%" align="center"><a href="http://survey.amazonwebservices.com/survey/s?s=559&amp;opdata_page=Mturk_API_2008-08-02_ApiReference_NotificationReceptorAPI_SOAPTransportArticle">Documentation Feedback</a></td><td width="30%" align="right"> </td></tr></table><div class="breadcrumb"><a href="Welcome.html">Welcome</a><a href=""></a> &raquo; <a href="ApiReference_NotificationReceptorAPIArticle.html">The Notification Receptor API</a> &raquo; <strong>The SOAP Transport</strong></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h1 class="topictitle">The SOAP Transport</h1></div></div></div><a class="indexterm" name="d0e20840"></a><p> The SOAP notification transport makes an HTTP connection to your notification receptor, and sends
		the notification message according to the SOAP web services standard. </p><p> The <em class="parameter"><code>Destination</code></em> that you specify in your <a class="link" href="ApiReference_NotificationDataStructureArticle.html" title="Notification">notification specification</a> is the
		"end point" (URL) Amazon Mechanical Turk will use for the SOAP request. In other words, this is the URL of
		your web service. </p><p> The SOAP API Amazon Mechanical Turk expects to use for notification messages is described by the
		notification WSDL, which is located at: </p><p>
		<a class="ulink" href="http://mechanicalturk.amazonaws.com/AWSMechanicalTurk/2006-05-05/AWSMechanicalTurkRequesterNotification.wsdl" target="_blank">http://mechanicalturk.amazonaws.com/AWSMechanicalTurk/2006-05-05/AWSMechanicalTurkRequesterNotification.wsdl</a>
	</p><p> Amazon Mechanical Turk calls the <em class="parameter"><code>Notify</code></em> operation of this WSDL, using the end point
		you specified in the notification specification. </p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Note"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Note]" src="images/note.png"></td><th align="left">Note</th></tr><tr><td align="left" valign="top"><p> Only ports 80 and 443 are supported for receiving SOAP notification messages. </p></td></tr></table></div><p> Parameters to the <em class="parameter"><code>Notify</code></em> operation call correspond to the parameters
		described in <a class="link" href="#">???</a>, such as
			<em class="parameter"><code>Signature</code></em>, <em class="parameter"><code>Timestamp</code></em>, and
		<em class="parameter"><code>Version</code></em>. Each event is represented in the SOAP request by a
		<em class="parameter"><code>Event</code></em> element, with sub-elements for each property of an event (such as
			<em class="parameter"><code>EventTime</code></em>). </p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both" id="d0e20892">Sample Message</h2></div></div></div><p> The following is an example notification message using the SOAP transport, including the SOAP
			wrapper. </p><pre class="programlisting">&lt;?xml version="1.0" encoding="UTF-8"?&gt;
   &lt;soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
      &lt;soapenv:Body&gt;
         &lt;Notify xmlns="http://requester.mturk.amazonaws.com/doc/2006-05-05"&gt;
            &lt;Signature&gt;<em class="replaceable"><code>[signature generated from your secret key]</code></em>&lt;/Signature&gt;
            &lt;Timestamp xsi:type="xsd:dateTime"&gt;2006-05-23T23:22:30Z&lt;/Timestamp&gt;
            &lt;Version&gt;2006-05-05&lt;/Version&gt;
            &lt;Event&gt;
               &lt;EventType&gt;AssignmentAccepted&lt;/EventType&gt;
               &lt;EventTime&gt;2006-04-21T18:55:23Z&lt;/EventTime&gt;
               &lt;HITTypeId&gt;KDSFO4455LKDAF3&lt;/HITTypeId&gt;
               &lt;HITId&gt;KDSFO4455LKDAF3&lt;/HITId&gt;
               &lt;AssignmentId&gt;KDSFO4455LKDAF3KDSFO4455LKDAF3&lt;/AssignmentId&gt;
            &lt;/Event&gt;
            &lt;Event&gt;
               &lt;EventType&gt;AssignmentReturned&lt;/EventType&gt;
               &lt;EventTime&gt;2006-04-21T18:55:23Z&lt;/EventTime&gt;
               &lt;HITTypeId&gt;KDSFO4455LKDAF3&lt;/HITTypeId&gt;
               &lt;HITId&gt;KDSFO4455LKDAF3KDSFO4455LKDAF3&lt;/HITId&gt;
               &lt;AssignmentId&gt;KDSFO4455LKDAF3KDSFO4455LKDAF3&lt;/AssignmentId&gt;
            &lt;/Event&gt;
         &lt;/Notify&gt;
      &lt;/soapenv:Body&gt;
   &lt;/soapenv:Envelope&gt;</pre></div></div><div class="navfooter"><table width="100%" summary="Navigation footer" cellspacing="0" cellpadding="2"><tr><td width="30%" align="left"><a accesskey="p" href="ApiReference_NotificationReceptorAPI_RESTTransportArticle.html"><img src="images/prev.gif" alt="Prev"></a> </td><td width="40%" align="center"><a href="http://survey.amazonwebservices.com/survey/s?s=559&amp;opdata_page=Mturk_API_2008-08-02_ApiReference_NotificationReceptorAPI_SOAPTransportArticle">Documentation Feedback</a><br><a href="copyrightinfo.html">Copyright Information</a></td><td width="30%" align="right"> </td></tr><tr><td width="30%" align="left" valign="top">&nbsp;</td><td width="40%" align="center"><a accesskey="h" href="#top"><img src="images/home.gif" alt="Home"></a></td><td width="30%" align="right" valign="top">&nbsp;</td></tr></table></div></body></html>